[
  {
    "title": "Introduction to Web Development",
    "description": "Learn the basics of HTML, CSS, and JavaScript to build your first website.",
    "prerequisites": "None",
    "duration": "6 weeks",
    "author": [
      {
        "_id": "676a7a6a4795607bde9d34bf",
        "name": "Dr. Alan Turing"
      }
    ],
    "lesson": [
      {
        "title": "HTML Basics",
        "description": "Understand the structure of web pages using HTML."
      },
      {
        "title": "CSS Essentials",
        "description": "Learn how to style web pages using CSS."
      }
    ],
    "enrolledStudent": [
      {
        "_id": "64c5e3f812e3c5d5f9b5c6d2",
        "name": "Jane Smith"
      },
      {
        "_id": "64c5e3f812e3c5d5f9b5c6d3",
        "name": "Ali Khan"
      }
    ]
  },
  {
    "title": "Advanced JavaScript",
    "description": "Deep dive into JavaScript with ES6, asynchronous programming, and advanced concepts.",
    "prerequisites": "Basic JavaScript knowledge",
    "duration": "8 weeks",
    "author": [
      {
        "_id": "676a7a6a4795607bde9d34bf",
        "name": "Dr. Alan Turing"
      }
    ],
    "lesson": [
      {
        "title": "ES6 and Beyond",
        "description": "Explore modern JavaScript features introduced in ES6."
      },
      {
        "title": "Asynchronous Programming",
        "description": "Learn about promises, async/await, and event loops."
      }
    ],
    "enrolledStudent": [
      {
        "_id": "64c5e3f812e3c5d5f9b5c6d5",
        "name": "Michael Johnson"
      },
      {
        "_id": "64c5e3f812e3c5d5f9b5c6d6",
        "name": "Emily Davis"
      }
    ]
  },
  {
    "title": "Python for Beginners",
    "description": "Start programming with Python, one of the most beginner-friendly languages.",
    "prerequisites": "None",
    "duration": "4 weeks",
    "author": [
      {
        "_id": "676a7a6a4795607bde9d34bf",
        "name": "Dr. Alan Turing"
      }
    ],
    "lesson": [
      {
        "title": "Introduction to Python",
        "description": "Learn Python syntax, variables, and basic concepts."
      },
      {
        "title": "Control Flow in Python",
        "description": "Understand how to use loops and conditionals."
      }
    ],
    "enrolledStudent": [
      {
        "_id": "64c5e3f812e3c5d5f9b5c6d7",
        "name": "Sophia Martinez"
      }
    ]
  },
  {
    "title": "Data Structures and Algorithms",
    "description": "Understand the fundamentals of data structures and algorithms for efficient problem-solving.",
    "prerequisites": "Basic programming knowledge",
    "duration": "10 weeks",
    "author": [
      {
        "_id": "676a7a6a4795607bde9d34bf",
        "name": "Dr. Alan Turing"
      }
    ],
    "lesson": [
      {
        "title": "Introduction to Algorithms",
        "description": "Learn what algorithms are and how they are analyzed."
      },
      {
        "title": "Sorting Algorithms",
        "description": "Explore common sorting algorithms like quicksort and mergesort."
      }
    ],
    "enrolledStudent": [
      {
        "_id": "64c5e3f812e3c5d5f9b5c6d8",
        "name": "Liam Brown"
      }
    ]
  },
  {
    "title": "Machine Learning Basics",
    "description": "Learn the fundamentals of machine learning and how to build simple models.",
    "prerequisites": "Basic Python knowledge",
    "duration": "12 weeks",
    "author": [
      {
        "_id": "676a7a6a4795607bde9d34bf",
        "name": "Dr. Alan Turing"
      }
    ],
    "lesson": [
      {
        "title": "Introduction to Machine Learning",
        "description": "Understand the basics of supervised and unsupervised learning."
      },
      {
        "title": "Linear Regression",
        "description": "Learn how to implement linear regression models."
      }
    ],
    "enrolledStudent": [
      {
        "_id": "64c5e3f812e3c5d5f9b5c6d9",
        "name": "Ethan Taylor"
      }
    ]
  },
  {
    "title": "React for Beginners",
    "description": "Build dynamic and interactive user interfaces with React.js.",
    "prerequisites": "Basic JavaScript knowledge",
    "duration": "8 weeks",
    "author": [
      {
        "_id": "676a7a6a4795607bde9d34bf",
        "name": "Dr. Alan Turing"
      }
    ],
    "lesson": [
      {
        "title": "React Components",
        "description": "Learn how to build and use components in React."
      },
      {
        "title": "State and Props",
        "description": "Understand how state and props work in React applications."
      }
    ],
    "enrolledStudent": []
  },
  {
    "title": "Introduction to Databases",
    "description": "Learn how to work with databases using SQL.",
    "prerequisites": "None",
    "duration": "6 weeks",
    "author": [
      {
        "_id": "676a7a6a4795607bde9d34bf",
        "name": "Dr. Alan Turing"
      }
    ],
    "lesson": [
      {
        "title": "SQL Basics",
        "description": "Learn how to create, read, update, and delete data using SQL."
      },
      {
        "title": "Database Design",
        "description": "Understand how to design efficient databases."
      }
    ],
    "enrolledStudent": [
      {
        "_id": "64c5e3f812e3c5d5f9b5c6d10",
        "name": "Chloe Wilson"
      }
    ]
  },
  {
    "title": "Cloud Computing Essentials",
    "description": "Understand the basics of cloud computing and its applications.",
    "prerequisites": "None",
    "duration": "5 weeks",
    "author": [
      {
        "_id": "676a7a6a4795607bde9d34bf",
        "name": "Dr. Alan Turing"
      }
    ],
    "lesson": [
      {
        "title": "What is Web Development?",
        "content": "Web development refers to the process of building and maintaining websites. It encompasses a variety of tasks and skills, including web design, content creation, client-side and server-side scripting, and network security configuration. Websites can range from simple static pages to complex web applications, online stores, and social media platforms. Web development is categorized into three main types: front-end development, which deals with the user-facing part of a website; back-end development, which handles server-side functionality and databases; and full-stack development, which combines both. This lesson will cover the role of a web developer, tools used in the field, and the evolution of web development from simple HTML pages to modern frameworks like React and Angular."
      },
      {
        "title": "Understanding the Web: How It Works",
        "content": "The web operates through a network of interconnected computers and servers that communicate using protocols like HTTP and HTTPS. A website is hosted on a server, and users access it using a browser on their computer or mobile device. When you enter a URL into your browser, it sends a request to a server. The server processes the request and sends back the required resources, such as HTML, CSS, and JavaScript files, which your browser uses to display the website. This lesson will delve into concepts such as DNS, IP addresses, and the client-server model. You will also learn about different types of websites, including static, dynamic, and single-page applications, and how they are structured."
      },
      {
        "title": "Introduction to HTML: The Structure of the Web",
        "content": "HTML, or HyperText Markup Language, is the backbone of all websites. It provides the structure and layout of web pages by using elements like headings, paragraphs, images, links, and lists. In this lesson, we will cover the basic syntax of HTML, including tags, attributes, and nesting elements. You'll learn how to create a simple web page with a title, headings, paragraphs, and images. Additionally, we will explore semantic HTML, which helps improve accessibility and SEO by using meaningful tags like \u003cheader\u003e, \u003cmain\u003e, and \u003cfooter\u003e. By the end of this lesson, you will have a solid foundation in creating well-structured HTML documents."
      },
      {
        "title": "Styling with CSS: Making Your Website Beautiful",
        "content": "CSS, or Cascading Style Sheets, is used to style and design web pages. It allows you to control the color, layout, fonts, and overall appearance of your website. In this lesson, we will cover the basics of CSS, including selectors, properties, and values. You will learn how to apply styles directly within HTML using inline styles, embed them in the \u003cstyle\u003e tag, or use external CSS files for better organization. We'll also discuss the box model, which defines how elements are sized and spaced, and introduce responsive design concepts using media queries. Practical examples will include creating layouts, styling buttons, and adding hover effects."
      },
      {
        "title": "JavaScript Basics: Adding Interactivity to Your Website",
        "content": "JavaScript is a versatile programming language that enables you to add interactivity and dynamic behavior to your website. From simple tasks like form validation and dropdown menus to complex web applications, JavaScript powers it all. This lesson will introduce the fundamentals of JavaScript, including variables, data types, operators, functions, and events. You will learn how to write basic scripts, manipulate the Document Object Model (DOM), and respond to user interactions. We will also touch on best practices, such as debugging and structuring your code for readability. By the end of this lesson, you will be able to create interactive web elements like image sliders and modal pop-ups."
      },
      {
        "title": "Introduction to Version Control with Git",
        "content": "Version control is a critical skill for any web developer. It allows you to track changes to your code, collaborate with others, and revert to previous versions if necessary. Git is the most widely used version control system, and platforms like GitHub provide a collaborative environment for developers. In this lesson, we will cover the basics of Git, including initializing repositories, committing changes, and branching. You'll learn common Git commands like \"git add,\" \"git commit,\" and \"git push.\" We'll also demonstrate how to use GitHub to host your projects, create pull requests, and resolve merge conflicts. By the end of this lesson, you will be comfortable managing your code using Git and collaborating with other developers."
      },
      {
        "title": "Introduction to Responsive Web Design",
        "content": "With the increasing use of mobile devices, responsive web design has become essential. Responsive design ensures that your website looks and works well on screens of all sizes, from desktops to smartphones. In this lesson, we will explore the principles of responsive design, including flexible layouts, fluid grids, and media queries. You will learn how to use CSS frameworks like Bootstrap or TailwindCSS to create responsive designs quickly. We'll also discuss mobile-first design strategies and test your website on various devices and screen resolutions. Practical exercises will include creating a responsive navigation bar and optimizing images for different screen sizes."
      },
      {
        "title": "Hosting Your First Website",
        "content": "Hosting your website is the final step in making it accessible to the world. This lesson will guide you through the process of choosing a hosting provider, purchasing a domain name, and deploying your website. We will discuss the differences between shared hosting, VPS hosting, and cloud hosting, and introduce platforms like Netlify and Vercel for modern web developers. You'll also learn about FTP, SSH, and other tools for uploading your files to the server. Additionally, we will cover basic website optimization techniques to improve load times and ensure reliability. By the end of this lesson, you will have your website live on the internet."
      }
    ],
    "enrolledStudent": [
      {
        "_id": "64c5e3f812e3c5d5f9b5c6d11",
        "name": "Oliver Scott"
      }
    ]
  }
]
